Repository: Andoni227/Renard
Catalog: Renard/Utils/*.lproj/Localizable.strings
Languages: es, ko, pt_pt

# selectTxt
source: Select
es: Seleccionar
ko: 선택
pt_pt: Selecionar

source: Cancel
es: Cancelar
ko: 취소
pt_pt: Cancelar

source: Save
es: Guardar
ko: 저장
pt_pt: Guardar

source: Loading...
es: Cargando...
ko: 로딩 중...
pt_pt: A carregar...

source: Downloading...
es: Descargando...
ko: 다운로드 중...
pt_pt: A descarregar...

source: Unknown
es: Desconocido
ko: 알 수 없는
pt_pt: Desconhecido

# accept
source: Ok
es: Aceptar
ko: 확인

# exportComplete
source: Export completed
es: Exportación completada
ko: 내보내기 완료
pt_pt: Exportação concluída

# deleteAfterSave
source: Delete original images after saving
es: Eliminar imágenes originales después de guardar
ko: 저장 후 원본 이미지 삭제
pt_pt: Eliminar imagens originais após guardar

# deleteAfterSaveOne
source: Delete original image after saving
es: Eliminar imagen original después de guardar
ko: 저장 후 원본 이미지 삭제
pt_pt: Eliminar imagem original após guardar

# downloadFailed
source: Failed to download the original image...
es: No se pudo descargar la imagen original...
ko: 원본 이미지 다운로드 실패...
pt_pt: Falha ao descarregar a imagem original...

source: Retry
es: Reintentar
ko: 다시 시도
pt_pt: Tentar novamente

# unknownErrorSaving
source: An unknown error occurred while saving 🤨
es: Ocurrió un error desconocido al guardar 🤨
ko: 저장 중 알 수 없는 오류가 발생했습니다 🤨
pt_pt: Ocorreu um erro desconhecido ao guardar 🤨

# unknownErrorExporting
source: An error occurred while exporting.
es: Ocurrió un error al exportar
ko: 내보내기 중 오류가 발생했습니다.
pt_pt: Ocorreu um erro ao exportar.

# saveSuccess
source: Image saved successfully!
es: ¡Imagen guardada con éxito!
ko: 이미지가 성공적으로 저장되었습니다!
pt_pt: Imagem guardada com sucesso!

# limitSelectedImages
source: To avoid long waiting times, consider selecting less than 40 photos.
es: Para evitar tiempos de espera largos, considera seleccionar menos de 40 fotos
ko: 긴 대기 시간을 피하기 위해, 40개 미만의 사진을 선택해보세요.
pt_pt: Para evitar tempos de espera longos, considere selecionar menos de 40 fotos.

# imagesAlreadyHEIF
source: These images are already compressed, please choose another format.
es: Estas imagenes ya están comprimidas, elige otro formato, por favor
ko: 이미지가 이미 압축되었습니다. 다른 형식을 선택해주세요.
pt_pt: Estas imagens já estão comprimidas. Por favor, escolha outro formato.

source: Loading library...
es: Cargando biblioteca...
ko: 라이브러리 불러오는 중...
pt_pt: A carregar biblioteca...

# cameraPermission
source: The application requires access to the gallery to function 😿
es: La aplicación requiere acceso a la galería para funcionar 😿
ko: 앱이 갤러리 접근 권한이 필요합니다 😿
pt_pt: A aplicação requer acesso à galeria para funcionar 😿

source: Open Settings
es: Abrir configuración
ko: 설정 열기
pt_pt: Abrir Definições

# InfoScreen1Title
source: What is Renard used for?
es: ¿Para qué sirve Renard?
ko: Renard는 무엇을 위해 사용되나요?
pt_pt: Para que serve o Renard?

# InfoScreen1Subtitle
source: Renard allows you to convert images from your gallery to the HEIF format, significantly reducing the image's file size without compromising quality and preserving all its metadata (location, date and time, camera information, parameters).
es: Renard pemite convertir las imágenes de tu galería a formato HEIF, reduciendo considerablemente el peso de la imagen sin comprometer la calidad y conservando todos sus metadatos (ubicación, fecha y hora, información de la cámara, parámetros).
ko: Renard를 사용하여 갤러리의 이미지를 HEIF 형식으로 변환하여 이미지 파일 크기를 크게 줄이고 품질을 저해하지 않으면서 위치, 날짜 및 시간, 카메라 정보, 매개변수 등 모든 메타데이터를 보존할 수 있습니다.
pt_pt: O Renard permite-lhe converter imagens da sua galeria para o formato HEIF, reduzindo significativamente o tamanho do ficheiro da imagem sem comprometer a qualidade e preservando todos os metadados (localização, data e hora, informações da câmara, parâmetros).

# InfoScreen2Title
source: How to use?
es: ¿Cómo se usa?
ko: 사용 방법은?
pt_pt: Como utilizar?

# InfoScreen2Subtitle
source: Select one or several photos from the gallery view, click on save, and Renard will convert the selected images to HEIF and save them in your gallery. Afterward, you will have the option to delete the original image to avoid having two identical photos.
es: Selecciona una o varias fotos desde la vista de galería, da clic en guardar y Renard convertirá las imágenes seleccionadas a HEIF, y las guardará en tu galería. Después te dará la opción de eliminar la imagen original para evitar tener dos fotos iguales.
ko: 갤러리 뷰에서 하나 이상의 사진을 선택한 후 저장을 클릭하면 Renard가 선택한 이미지를 HEIF로 변환하여 갤러리에 저장합니다. 그 후에는 동일한 사진 두 장이 중복되는 것을 피하기 위해 원본 이미지를 삭제할 수 있습니다.
pt_pt: Selecione uma ou várias fotos na vista de galeria, clique em guardar e o Renard irá converter as imagens selecionadas para HEIF e guardá-las na sua galeria. Posteriormente, terá a opção de eliminar a imagem original para evitar ter duas fotos idênticas.

# InfoScreen3Title
source: I deleted an original photo and want to recover it
es: Borré una foto original y quiero recuperarla
ko: 원본 사진을 삭제하고 복구하려면
pt_pt: Eliminei uma foto original e quero recuperá-la

# InfoScreen3Subtitle
source: Photos deleted by Renard are stored in the 'deleted items' folder in your gallery. If needed, you can recover them from there.
es: Las fotos eliminadas por Renard se guardan en la carpeta de eliminados de tu galería, si lo necesitas, desde ahí la puedes recuperar.
ko: Renard에 의해 삭제된 사진은 갤러리의 '삭제된 항목' 폴더에 저장됩니다. 필요한 경우 거기서 복구할 수 있습니다.
pt_pt: As fotos eliminadas pelo Renard são armazenadas na pasta 'itens eliminados' da sua galeria. Se necessário, pode recuperá-las a partir daí.

# InfoScreen4Title
source: Why aren't all my photos displayed?
es: ¿Por qué no se muestran todas mis fotos?
ko: 왜 내 모든 사진이 표시되지 않나요?
pt_pt: Porque é que nem todas as minhas fotos são exibidas?

# InfoScreen4Subtitle
source: HEIF images are already compressed efficiently enough to reduce their file size further. That's why they are not displayed in the app.
es: Las imágenes HEIF ya tienen una compresión lo suficientemente eficiente como para reducir aún más su peso. Por esa razón, no se muestran en la app.
ko: HEIF 이미지는 이미 효율적으로 압축되어 파일 크기를 더 줄일 수 있기 때문에 앱에서 표시되지 않습니다.
pt_pt: As imagens HEIF já estão comprimidas de forma suficientemente eficiente para reduzir ainda mais o tamanho do ficheiro. Por isso, não são exibidas na aplicação.

# InfoScreen5Title
source: Are my data safe?
es: ¿Mis datos están seguros?
ko: 내 데이터는 안전한가요?
pt_pt: Os meus dados estão seguros?

# InfoScreen5Subtitle
source: Renard does not collect any data, not even for statistical purposes.
es: Renard no recopila ningún tipo de dato, ni siquiera con fines estadísticos.
ko: Renard는 어떠한 데이터도 수집하지 않으며 통계 목적으로조차 사용하지 않습니다.
pt_pt: O Renard não recolhe quaisquer dados, nem mesmo para fins estatísticos.

# InfoScreen6Subtitle
source: Rate Renard ⭐️⭐️⭐️⭐️⭐️
es: Valorar Renard ⭐️⭐️⭐️⭐️⭐️
ko: Renard 평가하기 ⭐️⭐️⭐️⭐️⭐️
pt_pt: Classifique o Renard ⭐️⭐️⭐️⭐️⭐️

# InfoScreen7Subtitle
source: Renard uses resources from various artists:
es: Renard utiliza recursos de diversos artistas:
ko: Renard는 다양한 아티스트의 자료를 활용합니다:
pt_pt: O Renard utiliza recursos de vários artistas:

# InfoScreen8Subtitle
source: Contact ↗️
es: Contacto ↗️
ko: 연락처 ↗️
pt_pt: Contacto ↗️

# InfoScreen9Subtitle
source: Privacy Policy ↗️
es: Política de privacidad ↗️
ko: 개인정보 처리방침 ↗️
pt_pt: Política de Privacidade ↗️

# StatisticsScreenTitle
source: Gallery statistics
es: Estadisticas de la galería
ko: 갤러리 통계
pt_pt: Estatísticas da galeria

# MaxResPhoto
source: Highest resolution photo
es: Foto de mayor resolución
ko: 최고 해상도 사진
pt_pt: Foto com a maior resolução

# MinusResPhoto
source: Lowest resolution photo
es: Foto de menor resolución
ko: 최저 해상도 사진
pt_pt: Foto com a menor resolução

source: Most common format
es: Formato más común
ko: 가장 일반적인 형식
pt_pt: Formato mais comum

source: Less common format
es: Formato menos común
ko: 덜 일반적인 형식
pt_pt: Formato menos comum

source: Total photos
es: Fotos totales
ko: 전체 사진
pt_pt: Total de fotos

# saveMetadataBtn
source: Save metadata
es: Guardar metadatos
ko: 메타데이터 저장하기
pt_pt: Salvar metadados

source: Saved metadata
es: Metadatos guardados
ko: 저장된 메타데이터
pt_pt: Metadatos salvos

# saveMetadataAlert
source: Choose a name for this camera, the model and brand metadata will be saved, which you can later use to apply to other images
es: Elige un nombre para esta cámara, se guardaran los metadatos del modelo y marca de la cámara, los cuales podrás utilizar después para aplicarlos a otras imagenes
ko: 이 카메라에 이름을 선택하세요. 카메라 모델 및 브랜드 메타데이터가 저장되며, 이를 나중에 다른 이미지에 적용할 수 있습니다
pt_pt: Escolha um nome para esta câmera, os metadados do modelo e marca da câmera serão salvos, os quais você poderá usar posteriormente para aplicar a outras imagens

source: Camera name
es: Nombre de la cámara
ko: 카메라 이름
pt_pt: Nome da câmara

# saveAVIFAlert
source: This image is in AVIF format, which is more efficient than HEIF. The conversion could result in a heavier image but at the same time more compatible. Do you want to continue?
es: Esta imagen está en formato AVIF, que es más eficiente que HEIF. La conversión podría dar como resultado una imagen más grande, pero al mismo tiempo más compatible. ¿Quieres continuar?
ko: 이 이미지는 AVIF 형식으로 되어 있으며, 이는 HEIF보다 효율적입니다. 변환 과정에서 더 무거운 이미지가 될 수 있지만, 동시에 더 호환성이 있을 수 있습니다. 계속하시겠습니까?
pt_pt: Esta imagem está em formato AVIF, que é mais eficiente do que HEIF. A conversão poderá resultar numa imagem mais pesada, mas ao mesmo tempo mais compatível. Deseja continuar?

source: Preferences
es: Ajustes

# preferencesOption1
source: Delete original images by default
es: Eliminar imagenes originales de forma predeterminada

# preferencesOption2
source: Compression Level
es: Nivel de compresión

# PhotosFormatPostFix
source: Photos
ko: 개
